Series

In [ ]:
pip install pandas

In [ ]:
pip install xlrd

In [1]:
import pandas as pd

s = pd.Series(['a', 'b', 'c', 'd'])
s

0    a
1    b
2    c
3    d
dtype: object

In [2]:
s.index

RangeIndex(start=0, stop=4, step=1)

In [3]:
s.values

array(['a', 'b', 'c', 'd'], dtype=object)

In [4]:
s2 = pd.Series(['Russia', 'United States', 'Turkey'], index = ['ru', 'us', 'tr'])
s2

ru           Russia
us    United States
tr           Turkey
dtype: object

In [5]:
s2.index

Index(['ru', 'us', 'tr'], dtype='object')

In [6]:
s[[3]]

3    d
dtype: object

In [7]:
s2[['ru']]

ru    Russia
dtype: object

In [10]:
s[[1,2]] = -1
s

0     a
1    -1
2    -1
3     d
dtype: object

In [11]:
s[[0,3]] = 1
s

0     1
1    -1
2    -1
3     1
dtype: object

In [12]:
s[(s > 0)]

0    1
3    1
dtype: object

In [ ]:
s3 = pd.Series({'a': 3, 'b': 4, 'c': 5})
s3

DataFrame

In [13]:
df = pd.DataFrame({'name': ['Anna', 'Ivan', 'Aleksandr'], 'age': [53, 44, 18], 
                   'income': [51000, 100000, 15000], 
                   'marital_status': ['Single', 'Married', 'Single']})
df

        name  age  income marital_status
0       Anna   53   51000         Single
1       Ivan   44  100000        Married
2  Aleksandr   18   15000         Single

In [14]:
df.name

0         Anna
1         Ivan
2    Aleksandr
Name: name, dtype: object

In [15]:
type(df.name)

pandas.core.series.Series

In [16]:
df.index = ['a', 'b', 'c']
df

        name  age  income marital_status
a       Anna   53   51000         Single
b       Ivan   44  100000        Married
c  Aleksandr   18   15000         Single

In [17]:
df.loc['b']

name                 Ivan
age                    44
income             100000
marital_status    Married
Name: b, dtype: object

In [18]:
df.iloc[1]

name                 Ivan
age                    44
income             100000
marital_status    Married
Name: b, dtype: object

In [19]:
df.loc[['a', 'b'], 'name']

a    Anna
b    Ivan
Name: name, dtype: object

In [20]:
df.iloc[[0, 1], 1]

a    53
b    44
Name: age, dtype: int64

In [21]:
# условия
df[df.age > 50]

   name  age  income marital_status
a  Anna   53   51000         Single

In [22]:
df[df.age > 50]['name']

a    Anna
Name: name, dtype: object

In [23]:
df[df.marital_status == 'Single']

        name  age  income marital_status
a       Anna   53   51000         Single
c  Aleksandr   18   15000         Single

In [24]:
# создание новой колонки
df['new'] = df['age'] + 1
df

        name  age  income marital_status  new
a       Anna   53   51000         Single   54
b       Ivan   44  100000        Married   45
c  Aleksandr   18   15000         Single   19

In [25]:
# удаление
df.drop(['new'], axis = 1)

        name  age  income marital_status
a       Anna   53   51000         Single
b       Ivan   44  100000        Married
c  Aleksandr   18   15000         Single

In [26]:
df

        name  age  income marital_status  new
a       Anna   53   51000         Single   54
b       Ivan   44  100000        Married   45
c  Aleksandr   18   15000         Single   19

In [27]:
df.drop(['new'], axis = 1, inplace = True)
df

        name  age  income marital_status
a       Anna   53   51000         Single
b       Ivan   44  100000        Married
c  Aleksandr   18   15000         Single

In [28]:
df

        name  age  income marital_status
a       Anna   53   51000         Single
b       Ivan   44  100000        Married
c  Aleksandr   18   15000         Single

In [29]:
# экспорт данных
df.to_excel('file1.xlsx')

In [32]:
# импорт данных
df1 = pd.read_excel('file1.xlsx')
df1

  Unnamed: 0       name  age  income marital_status
0          a       Anna   53   51000         Single
1          b       Ivan   44  100000        Married
2          c  Aleksandr   18   15000         Single
3          d      Elena   24   32000         Single